app/Http/Controllers/ProductController.php

    public function update(ProductRequest $request, $id)
    {
        $data = $request->only([
            'name',
            'content',
            'quantity',
            'price'
        ]);

        $product = Product::findOrFail($id);

        try {
            $product->update($data);
---
update `products` set `name` = 'Áo sơ mi mềm dây rút eoo', `products`.`updated_at` = '2019-10-19 13:42:38' where `id` = 1